In [1]:
import pandas as pd

In [2]:
date_list = {
    "date": ["2000-06-27", "2002-09-24", "2005-12-20"]
}
df = pd.DataFrame(date_list)
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

#### map()

In [3]:
def extract_year(date):
    return date.split("-")[0]

In [5]:
# 앞에서 썼던 apply()와 같은 역할

df['year'] = df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [7]:
job_list = {
    "age":[20,30,30],
    "job":["student","developer","teacher"]
}
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [9]:
# 문자를 숫자로 바꿔야 하는 경우에 map 이 유용
# map으로 딕셔너리 형태를 넘길수 있다

df["job1"] = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age        job  job1
0   20    student     1
1   30  developer     2
2   30    teacher     3

#### applymap()

In [12]:
x_y = {
    "x": [5.5, -5.2, -1.6],
    "y": [-5.6, 5.5, -4.5],
    "z": [-1.1, -2.2, -3.3]
}
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [14]:
import numpy as np

In [17]:
# 하나의 컬럼이 아니라 모든 값에 적용하고 싶을 때

df = df.applymap(np.around)
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0